import "./style.scss";
import "swiper/css";
import "swiper/css/effect-cards";

import { Swiper, SwiperSlide } from "swiper/react";
import { EffectCards } from "swiper";

import { Autoplay, Pagination, Navigation } from "swiper";
import Blog from "../../components/Home/Blog";

import "swiper/css";
import "swiper/css/pagination";
import "swiper/css/navigation";

const BlogPage = () => {
  return (
    <div className="blog-page-container">
      <div>
        <Swiper
          spaceBetween={30}
          centeredSlides={true}
          autoplay={{
            delay: 2500,
            disableOnInteraction: false,
          }}
          pagination={{
            clickable: true,
          }}
          navigation={true}
          modules={[Autoplay, Pagination, Navigation]}
          className="mySwiper"
        >
          <SwiperSlide>
            <div id="adoption-stories" className="swiper-image-block">
              <h1>Про блог</h1>
              <p>
                  Ця сторінка - спеціальне місце для нашого блогу про адопцію тварин. Наш блог є цікавим ресурсом для
                  любителів домашніх тварин, потенційних усиновлювачів та тих, хто ще вагається.
              </p>
            </div>
          </SwiperSlide>
          <SwiperSlide>
            <div id="tips-guides" className="swiper-image-block">
              <h1>Підказки та інструкції</h1>
              <p>
                 Ми пропонуємо практичні поради, посібники та покрокові інструкції щодо
                 різних аспектів догляду за домашніми тваринами. Будь то знайомство з новою 
                 домашньою твариною, специфічне тренування, базова слухняність чи роботи з
                 поширеними проблемами поведінки - наш блог дає дієві поради власникам 
                 домашніх тварин в кожній з цих ситуацій.
              </p>
            </div>
          </SwiperSlide>
          <SwiperSlide>
            <div id="expert-advice" className="swiper-image-block">
              <h1>Поради експертів</h1>
              <p>
                 На сторінці нашого блогу представлені статті, написані досвідченими кінологами,
                 професіоналами, ветеринарами та тренерами. Вони дають експертні поради з різних тем, 
                 у тому числі щодо поведінки домашніх тварин, поради щодо дресирування, харчування, 
                 догляду та загального самопочуття домашніх тварин. Ми прагнемо надавати достовірну та 
                 актуальну інформацію, щоб допомогти власникам домашніх тварин забезпечити найкращий 
                 догляд за їхніми пухнастиками компаньйонами.
              </p>
            </div>
          </SwiperSlide>
        </Swiper>
      </div>
      <div className="stories">
        <h2>Щотижнева  щаслива  історія  адопції</h2>
        <div className="story-block">
          <h2>Лілія та Чарлі</h2>
          <img alt="story-1" src="./images/blog/story-1.png" />
          <p>
             В галасливому місті, наповненому високими хмарочосами і 
             жвавими вулицями, був скромний притулок для тварин під назвою «Лапки надії». 
             Це було місце, де махали хвостами і очі, повні надії, з нетерпінням чекали 
             свого шансу отримати вічний дім. Одного доленосного дня, молода жінка на 
             ім’я Лілія прийшла до дверей притулку. Її серце прагнуло завестися пухнастим 
             другом, що розділить із нею її життєві пригоди. Коли вона увійшла, її зустріла 
             симфонія гавкання та нявкання, кожне з яких благало про любов та новий дім.
             Серед хаосу увагу Лілі привернув маленький знесилений песик. Його звали Чарлі,
             сором'язлива й боязка душа, яка пережила труднощі в минулому. Лілія побачила спалах 
             надії в його очах, і вона знала, що знайшла собі ідеальну пару. Подолавши усі свої 
             сумніви та переживання, Ліля прийняла рішення усиновити Чарлі та подарувати йому
             свою любов і стабільність, яких він так прагнув. З кожним помахом свого хвоста 
             і ніжним штовханням її руки, Чарлі мовчки дякував за те, що вона розгледіла його 
             ніжну душу за серйозним та боязким тілом. З того часу вони багато мандрували
             і ніколи не розділялись, адже стали невід'ємною частиною життя одне одного.
          </p>
        </div>
      </div>
      <div className="tips-guides">
        <h1>Підказки та інструкції</h1>
        <div className="tips">
          <img src="./images/blog/useful-cat.png" />
          <Swiper
            effect={"cards"}
            grabCursor={true}
            modules={[EffectCards]}
            className="mySwiper"
          >
            <SwiperSlide >
              <h1>
              <p className="swiper-title">Збалансоване харчування:</p> Годуйте свого улюбленця високоякісним кормом, що відповідає його виду, віку та стану здоров’я. Проконсультуйтеся з ветеринаром, щоб визначити правильний раціон для вашого вихованця.
              </h1>
              <img src="images/blog/tip-1.png" />
            </SwiperSlide>
            <SwiperSlide >
              <h1>
              <p className="swiper-title">Регулярні фізичні вправи:</p> Собаки, коти та інші домашні тварини потребують регулярних фізичних вправ, щоб підтримувати своє фізичне та психічне благополуччя. Залучайте їх до ігор, прогулянок або інших видів діяльності, які відповідають їхньому рівню енергії та здібностям.
              </h1>
              <img src="images/blog/exercise.png" />
            </SwiperSlide>
            <SwiperSlide >
              <h1>
              <p className="swiper-title">Догляд:</p> Регулярний догляд необхідний для підтримки шерсті, нігтів і зубів вашого вихованця в хорошому стані. Розчісуйте їм шерсть, стрижіть їм кігті та чистіть зуби відповідно до рекомендацій ветеринара.
              </h1>
              <img src="images/blog/grooming.png" />
            </SwiperSlide>
            <SwiperSlide >
              <h1>
              <p className="swiper-title">Регулярні ветеринарні огляди:</p> Заплануйте регулярні візити до ветеринара для огляду здоров’я та вакцинації. Регулярні огляди можуть допомогти вчасно виявити будь-які потенційні проблеми зі здоров’ям і забезпечити благополуччя вашого вихованця.
              </h1>
              <img src="images/blog/veterinary.png" />
            </SwiperSlide>
            <SwiperSlide >
              <h1>
              <p className="swiper-title">Соціалізація:</p> Спілкуйтеся з тваринами та людьми з раннього дитинства, щоб допомогти їм розвинути позитивну поведінку та зменшити тривогу чи агресію.
              </h1>
              <img src="images/blog/socialization.png" />
            </SwiperSlide>
            <SwiperSlide >
              <h1>
              <p className="swiper-title">Безпечне середовище:</p> Створіть безпечне середовище для свого вихованця, прибравши будь-які небезпечні предмети, які вони можуть проковтнути. Тримайте шнури, рослини, хімікати та дрібні предмети в недоступному для них місці, слідкуйте за ними під час прогулянок.
              </h1>
              <img src="images/blog/save-environment.png" />
            </SwiperSlide>
          </Swiper>
        </div>
      </div>
    </div>
  );
};

export default BlogPage;
